
#c언어와 다르게 '변수 선언'을 할 필요가 없다.
#모든 값의 대상들을 객체화했기 때문이다
# == --> 같은지 다른지 확인가능하다 : True or False로 결과값 도출
#파이썬에서 두 변수에 할당된 값을 동시에 바꾸기가 가능하다 : 튜플 ex) x,y = y,x
# 원래는 임시의 변수 temp(제 3자)를 이용한다////

#tuple_튜플 : 고정 <-> 리스트 ex) x = 10, 20 / x = (10, 20)


#참조하는 ㄱ것이 똑같은 것인지 찾아보는 방법 : id()
# -256~+256, alphabet, 같은 alphabet을 사용 한 '문자특수기호'는 안된다)

#(자주 쓰는 객체는 액세스를 빠르게하기 위함_ ID주소가 같다)



#변수의 이름 --> 숫자/언더 바 가 제일 먼저 오지 못한다, 내장함수(지정단어)를 변수로 쓸 수는 있지만 쓰게 
# 되면 본래의 내장함수의 기능을 하지 못하게 된다



#len() --> 개수 구하는 함수 _ 문자열은 가능하지만 정수형은 카운트가 불가능하다
# 튜플의 경우 안에 있는 개수만큼 카운트된다


#파이썬에서 상수형변수는 모두 대문자로 표기한다.

